import {
  CardType,
  DonationProjectsType,
  FAQsType,
  NeedsNetworkSectionsType,
  RuningProjectsType,
} from "@/types/types";

export const cardItems: CardType[] = [
  {
    img: "/images/1.png",
    title: "پاکسازی طبیعت",
    description:
      "بعضی نیازهای روزمره برنامه نویسی در همه زبان ها همیشه مورد نیاز هستند. مهم ترین اینها توابع و کتابخانه های کار با اعداد و زبان و تبدیل های مختلف اونهاست.",
    href: "/1",
  },
  {
    img: "/images/2.png",
    title: "دست در دست",
    description:
      "بعضی نیازهای روزمره برنامه نویسی در همه زبان ها همیشه مورد نیاز هستند. مهم ترین اینها توابع و کتابخانه های کار با اعداد و زبان و تبدیل های مختلف اونهاست.",
    href: "/2",
  },
  {
    img: "/images/hero_img.jpg",
    title: "راستۀ خیریه",
    description:
      "بعضی نیازهای روزمره برنامه نویسی در همه زبان ها همیشه مورد نیاز هستند. مهم ترین اینها توابع و کتابخانه های کار با اعداد و زبان و تبدیل های مختلف اونهاست.",
    href: "/3",
  },
  {
    img: "/images/1.png",
    title: "راستا",
    description:
      "بعضی نیازهای روزمره برنامه نویسی در همه زبان ها همیشه مورد نیاز هستند. مهم ترین اینها توابع و کتابخانه های کار با اعداد و زبان و تبدیل های مختلف اونهاست.",
    href: "/4",
  },
  {
    img: "/images/hero_img.jpg",
    title: "راستۀ خیریه",
    description:
      "بعضی نیازهای روزمره برنامه نویسی در همه زبان ها همیشه مورد نیاز هستند. مهم ترین اینها توابع و کتابخانه های کار با اعداد و زبان و تبدیل های مختلف اونهاست.",
    href: "/5",
  },
];

export const FaqsItems: FAQsType[] = [
  {
    question: "کانون مسئولیت اجتماعی مهر باران کجاست؟",
    answer:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد",
  },
  {
    question: "چطور می‌توانیم با مهر باران همکاری کنیم؟",
    answer:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد",
  },
  {
    question: "آیا برنامه‌های مهر باران از قبل تعیین شده است یا قابلیت اجرای ایده‌های نو وجود دارد؟",
    answer:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد",
  },
];

type CombinedProjectType = RuningProjectsType & DonationProjectsType;
export const projects: CombinedProjectType[] = [
  {
    id: "1",
    title: "نان و پنیر و همدلی",
    description:
      " با استفاده از طراحان گرافیک است گرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی",
    img: "/images/1.png",
    targetAmount: 50000000,
    collectedAmount: 17500000,
    targetVolunteer: 100,
    collectedVolunteer: 50,
    totalRaised: "میزان مبلغ تأمین‌شده",
    requiredVolunteers: "تعداد داوطلب مورد نیاز",
    deadLine: 20,
  },
  {
    id: "2",
    title: "به رنگ شادی",
    description:
      " با استفاده از طراحان گرافیک است گرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی",
    img: "/images/2.png",
    targetAmount: 46500000,
    collectedAmount: 22000000,
    targetVolunteer: 100,
    collectedVolunteer: 30,
    totalRaised: "میزان مبلغ تأمین‌شده",
    requiredVolunteers: "تعداد داوطلب مورد نیاز",
    deadLine: 30,
  },
];

export const needsNetworkSections: NeedsNetworkSectionsType[] = [
  {
    title: "مسئولیت اجتماعی",
    subtitle: "با هم برای جامعه",
    icon: "/icons/helping_blue.svg",
    description:
      "فعالیت‌های داوطلبانه و عام‌المنفعه سازمان دانشجویان جهاد بخشی از فرهنگ‌سازی جامعه هدف اسفعالیت‌های داوطلبانه و عام‌المنفعه سازمان دانشجویان جهاد بخشی از فرهنگ‌سازی جامعه هدف اس",
    link: "social-responsibility",
    subject: [
      {
        title: "تأمین آب شرب",
        description:
          "فعالیت‌های داوطلبانه و عام‌المنفعه سازمان دانشجویان جهاد داوطلبانه و عام‌المنفعه سازمان از فرهنگ‌سازی جامعه هدف اس",
        comments: ["موافقم", "نه"],
        totalVote: 784,
        images: [""],
      },
      {
        title: "تأمین آب شرب",
        description:
          "فعالیت‌های داوطلبانه و عام‌المنفعه سازمان دانشجویان جهاد داوطلبانه و عام‌المنفعه سازمان از فرهنگ‌سازی جامعه هدف اس",
        comments: ["موافقم", "نه"],
        totalVote: 456,
        images: [""],
      },
      {
        title: "تأمین آب شرب",
        description:
          "فعالیت‌های داوطلبانه و عام‌المنفعه سازمان دانشجویان جهاد داوطلبانه و عام‌المنفعه سازمان از فرهنگ‌سازی جامعه هدف اس",
        comments: ["موافقم", "نه"],
        totalVote: 124,
        images: [""],
      },
    ],
  },
  {
    title: "اردوهای جهادی",
    subtitle: "پای کار با روحیه جهادی",
    icon: "/icons/welfare_blue.svg",
    description:
      "فعالیت‌های داوطلبانه و عام‌المنفعه سازمان دانشجویان جهاد بخشی از فرهنگ‌سازی جامعه هدف اسفعالیت‌های داوطلبانه و عام‌المنفعه سازمان دانشجویان جهاد بخشی از فرهنگ‌سازی جامعه هدف اس",
    link: "volunteer-camps",
    subject: [
      {
        title: "ساختن مدرسه",
        description:
          "فعالیت‌های داوطلبانه و عام‌المنفعه سازمان دانشجویان جهاد داوطلبانه و عام‌المنفعه سازمان از فرهنگ‌سازی جامعه هدف اس",
        comments: ["موافقم", "نه"],
        totalVote: 124,
        images: [""],
      },
      {
        title: "ساختن مدرسه",
        description:
          "فعالیت‌های داوطلبانه و عام‌المنفعه سازمان دانشجویان جهاد داوطلبانه و عام‌المنفعه سازمان از فرهنگ‌سازی جامعه هدف اس",
        comments: ["موافقم", "نه"],
        totalVote: 410,
        images: [""],
      },
    ],
  },
  {
    title: "خیر مؤثر",
    subtitle: "نیکوکاری با برنامه",
    icon: "/icons/welfare_blue.svg",
    description:
      "فعالیت‌های داوطلبانه و عام‌المنفعه سازمان دانشجویان جهاد بخشی از فرهنگ‌سازی جامعه هدف اسفعالیت‌های داوطلبانه و عام‌المنفعه سازمان دانشجویان جهاد بخشی از فرهنگ‌سازی جامعه هدف اس",
    link: "effective-altruism",
    subject: [
      {
        title: "ساختن مدرسه",
        description:
          "فعالیت‌های داوطلبانه و عام‌المنفعه سازمان دانشجویان جهاد داوطلبانه و عام‌المنفعه سازمان از فرهنگ‌سازی جامعه هدف اس",
        comments: ["موافقم", "نه"],
        totalVote: 32,
        images: [""],
      },
      {
        title: "ساختن مدرسه",
        description:
          "فعالیت‌های داوطلبانه و عام‌المنفعه سازمان دانشجویان جهاد داوطلبانه و عام‌المنفعه سازمان از فرهنگ‌سازی جامعه هدف اس",
        comments: ["موافقم", "نه"],
        totalVote: 658,
        images: [""],
      },
    ],
  },
  {
    title: "محیط زیست",
    subtitle: "زمین رو سبز نگه داریم",
    icon: "/icons/earthGlobe_blue.svg",
    description:
      "فعالیت‌های داوطلبانه و عام‌المنفعه سازمان دانشجویان جهاد بخشی از فرهنگ‌سازی جامعه هدف اسفعالیت‌های داوطلبانه و عام‌المنفعه سازمان دانشجویان جهاد بخشی از فرهنگ‌سازی جامعه هدف اس",
    link: "environment",
    subject: [
      {
        title: "پاک کردن دنیا",
        description:
          "فعالیت‌های داوطلبانه و عام‌المنفعه سازمان دانشجویان جهاد داوطلبانه و عام‌المنفعه سازمان از فرهنگ‌سازی جامعه هدف اس",
        comments: ["موافقم", "نه"],
        totalVote: 122,
        images: [""],
      },
    ],
  },
];
