import FaqSection from "@/components/views/faqs_co/FaqSection";
import { FAQsType } from "@/types/types";
import React from "react";

const FaqsItems: FAQsType[] = [
  {
    question: "کانون مسئولیت اجتماعی مهر باران کجاست؟",
    answer:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد",
  },
  {
    question: "چطور می‌توانیم با مهر باران همکاری کنیم؟",
    answer:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد",
  },
  {
    question: "آیا برنامه‌های مهر باران از قبل تعیین شده است یا قابلیت اجرای ایده‌های نو وجود دارد؟",
    answer:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد",
  },
];
const FAQs: React.FC = ({}) => {
  return (
    <div className="w-full md:w-6/10 mx-auto my-8">
      <h1 className="text-2xl font-bold mb-6 px-3">
        <span className="text-3xl">▪ </span>سوالات پرتکرار
      </h1>
      <div>
        {FaqsItems.map((faq, index) => (
          <div key={index}>
            <FaqSection answer={faq.answer} question={faq.question} />
          </div>
        ))}
      </div>
    </div>
  );
};

export default FAQs;
